/*
Navicat MySQL Data Transfer

Source Server         : LBSN
Source Server Version : 50642
Source Host           : 47.107.95.148 :3306
Source Database       : lbsn

Target Server Type    : MYSQL
Target Server Version : 50642
File Encoding         : 65001

Date: 2018-12-28 21:29:44
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `poi`
-- ----------------------------
DROP TABLE IF EXISTS `poi`;
CREATE TABLE `poi` (
  `poiId` int(20) NOT NULL AUTO_INCREMENT,
  `address` varchar(100) DEFAULT NULL,
  `cityName` varchar(100) DEFAULT NULL,
  `longitude` float(20,6) DEFAULT NULL,
  `latitude` float(20,6) DEFAULT NULL,
  `category` varchar(40) DEFAULT NULL,
  PRIMARY KEY (`poiId`)
) ENGINE=InnoDB AUTO_INCREMENT=135 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of poi
-- ----------------------------
INSERT INTO `poi` VALUES ('1', '西安电子科技大学北校区操场', '西安市', '108.924500', '34.237534', '校园社区');
INSERT INTO `poi` VALUES ('2', '太白南路人人乐超市', '西安市', '108.925362', '34.241707', '商场超市');
INSERT INTO `poi` VALUES ('3', '西安电子科技学体育馆', '西安市', '108.922684', '34.238029', '校园社区');
INSERT INTO `poi` VALUES ('4', '赛格国际购物中心', '西安市', '108.954803', '34.229908', '商场超市');
INSERT INTO `poi` VALUES ('5', '大雁塔', '西安市', '108.971153', '34.225620', '名胜古迹');
INSERT INTO `poi` VALUES ('6', '大雁塔音乐喷泉', '西安市', '108.970573', '34.227547', '公园广场');
INSERT INTO `poi` VALUES ('7', '和居家养老生活馆', '西安市', '108.967796', '34.228542', '健康养生');
INSERT INTO `poi` VALUES ('8', '陕西戏曲大观园', '西安市', '108.974236', '34.226288', '公园广场');
INSERT INTO `poi` VALUES ('9', '大唐慈恩寺遗址公园', '西安市', '108.974152', '34.223804', '公园广场');
INSERT INTO `poi` VALUES ('10', '大唐芙蓉园', '西安市', '108.980721', '34.218948', '公园广场');
INSERT INTO `poi` VALUES ('11', '陕西历史博物馆', '西安市', '108.961494', '34.230522', '名胜古迹');
INSERT INTO `poi` VALUES ('12', '陕西秦腔博物馆', '西安市', '108.986855', '34.248123', '名胜古迹');
INSERT INTO `poi` VALUES ('13', '钟楼', '西安市', '108.953461', '34.265724', '名胜古迹');
INSERT INTO `poi` VALUES ('14', '开元商城', '西安市', '108.954788', '34.264912', '商城超市');
INSERT INTO `poi` VALUES ('15', '钟楼饭店', '西安市', '108.952324', '34.264664', '美食养生');
INSERT INTO `poi` VALUES ('16', '回民街', '西安市', '108.950256', '34.266708', '美食养生');
INSERT INTO `poi` VALUES ('17', '民生百货', '西安市', '108.957565', '34.264912', '商城超市');
INSERT INTO `poi` VALUES ('18', '陕西省中医医院', '西安市', '108.951065', '34.270447', '健康养生');
INSERT INTO `poi` VALUES ('19', '钟鼓楼广场', '西安市', '108.948601', '34.265968', '公园广场');
INSERT INTO `poi` VALUES ('20', '碑林博物馆', '西安市', '108.959190', '34.260189', '名胜古迹');
INSERT INTO `poi` VALUES ('21', '大唐西市生活广场', '西安市', '108.915726', '34.253174', '公园广场');
INSERT INTO `poi` VALUES ('22', '小雁塔雁园皮影戏', '西安市', '108.948570', '34.246414', '影视戏曲');
INSERT INTO `poi` VALUES ('23', '西安古乐博物馆', '西安市', '108.948059', '34.244320', '名胜古迹');
INSERT INTO `poi` VALUES ('24', '兴庆宫公园', '西安市', '108.990448', '34.260284', '公园广场');
INSERT INTO `poi` VALUES ('25', '西安交通大学操场', '西安市', '108.992661', '34.252522', '校园社区');
INSERT INTO `poi` VALUES ('26', '青龙寺遗址', '西安市', '108.995667', '34.239227', '名胜古迹');
INSERT INTO `poi` VALUES ('27', '西安城墙-西门', '西安市', '108.932594', '34.265335', '名胜古迹');
INSERT INTO `poi` VALUES ('28', '西安城墙-南门', '西安市', '108.953384', '34.256924', '名胜古迹');
INSERT INTO `poi` VALUES ('29', '大明宫国家遗址公园', '西安市', '108.969894', '34.298634', '名胜古迹');
INSERT INTO `poi` VALUES ('30', '西安世博园', '西安市', '109.068237', '34.329601', '公园广场');
INSERT INTO `poi` VALUES ('31', '灞桥生态湿地地公园', '西安市', '109.083473', '34.313442', '公园广场');
INSERT INTO `poi` VALUES ('32', '西安博物馆', '西安市', '108.948196', '34.244663', '名胜古迹');
INSERT INTO `poi` VALUES ('33', '陕西省图书馆', '西安市', '108.950027', '34.237827', '校园社区');
INSERT INTO `poi` VALUES ('34', '西北工业大学操场', '西安市', '108.924850', '34.252167', '校园社区');
INSERT INTO `poi` VALUES ('35', '太白印象城广场', '西安市', '108.928223', '34.241104', '公园广场');
INSERT INTO `poi` VALUES ('36', '徐家庄好又多购物广场', '西安市', '108.919739', '34.235825', '商城超市');
INSERT INTO `poi` VALUES ('37', '陕西巷子老菜馆', '西安市', '108.911835', '34.241852', '美食养生');
INSERT INTO `poi` VALUES ('38', '陕西戏曲大观园', '西安市', '108.974007', '34.226463', '影视戏曲');
INSERT INTO `poi` VALUES ('40', '戏曲小剧场', '碑林区', '108.962135', '34.258533', '影视戏曲');
INSERT INTO `poi` VALUES ('41', '秦韵戏曲茶吧', '碑林区', '108.960732', '34.259727', '影视戏曲');
INSERT INTO `poi` VALUES ('42', '戏曲茶座', '碑林区', '108.980598', '34.270828', '影视戏曲');
INSERT INTO `poi` VALUES ('43', '中山戏曲茶座', '新城区', '108.976479', '34.270260', '影视戏曲');
INSERT INTO `poi` VALUES ('44', '陕西大戏剧会馆', '碑林区', '108.956543', '34.250732', '影视戏曲');
INSERT INTO `poi` VALUES ('45', '陕西大剧院戏剧厅', '雁塔区', '108.969124', '34.216652', '影视戏曲');
INSERT INTO `poi` VALUES ('46', '西安市明清皮影艺术博物馆', '雁塔区', '108.971550', '34.217075', '影视戏曲');
INSERT INTO `poi` VALUES ('47', '西安城市运动公园', '未央区', '108.949638', '34.350826', '公园广场');
INSERT INTO `poi` VALUES ('49', '丰庆公园', '碑林区', '108.905190', '34.253609', '公园广场');
INSERT INTO `poi` VALUES ('50', '樱花广场', '长安区', '108.885048', '34.166473', '公园广场');
INSERT INTO `poi` VALUES ('51', '长乐公园', '碑林区', '109.005951', '34.267876', '公园广场');
INSERT INTO `poi` VALUES ('52', '未央湖公园', '未央区', '108.995743', '34.406490', '公园广场');
INSERT INTO `poi` VALUES ('53', '莲湖公园', '莲湖区', '108.946777', '34.274982', '公园广场');
INSERT INTO `poi` VALUES ('55', '革命公园', '新城区', '108.964973', '34.277893', '公园广场');
INSERT INTO `poi` VALUES ('56', '潏河湿地公园', '长安区', '108.921936', '34.148251', '公园广场');
INSERT INTO `poi` VALUES ('57', '桃花潭', '灞桥区', '109.039551', '34.309826', '公园广场');
INSERT INTO `poi` VALUES ('58', '曲江池', '雁塔区', '108.990524', '34.207962', '公园广场');
INSERT INTO `poi` VALUES ('59', '红光公园', '未央区', '108.847946', '34.269451', '公园广场');
INSERT INTO `poi` VALUES ('60', '西安秦岭野生动物园', '长安区', '108.873848', '34.053406', '公园广场');
INSERT INTO `poi` VALUES ('61', '陕西翠华山国家地质公园', '长安区', '109.018089', '33.979149', '公园广场');
INSERT INTO `poi` VALUES ('63', '西安植物园', '雁塔区', '109.036301', '34.215164', '公园广场');
INSERT INTO `poi` VALUES ('64', '华清宫', '临潼区', '109.221619', '34.364033', '名胜古迹');
INSERT INTO `poi` VALUES ('65', '西安烈士陵园', '雁塔区', '108.940063', '34.215328', '名胜古迹');
INSERT INTO `poi` VALUES ('66', '汉唐帝陵旅游区', '雁塔区', '109.031364', '34.186481', '名胜古迹');
INSERT INTO `poi` VALUES ('67', '日本飞机轰炸西安遗址', '莲湖区', '108.944786', '34.271404', '名胜古迹');
INSERT INTO `poi` VALUES ('68', '唐城墙遗址', '雁塔区', '108.978943', '34.210831', '名胜古迹');
INSERT INTO `poi` VALUES ('69', '张学良公馆', '长安区', '108.983696', '34.070930', '名胜古迹');
INSERT INTO `poi` VALUES ('70', '灵应寺', '长安区', '108.777237', '34.025146', '名胜古迹');
INSERT INTO `poi` VALUES ('71', '西安事变纪念馆', '莲湖区', '108.946243', '34.277737', '名胜古迹');
INSERT INTO `poi` VALUES ('72', '尚武门', '莲湖区', '108.939568', '34.281815', '名胜古迹');
INSERT INTO `poi` VALUES ('73', '古观音禅寺', '长安区', '108.798706', '34.031662', '名胜古迹');
INSERT INTO `poi` VALUES ('74', '大兴善寺', '雁塔区', '108.949898', '34.233208', '名胜古迹');
INSERT INTO `poi` VALUES ('75', '秦兵马俑壹号坑大厅', '临潼区', '109.284897', '34.389412', '名胜古迹');
INSERT INTO `poi` VALUES ('76', '西安事变纪念馆', '莲湖区', '108.974091', '34.263599', '名胜古迹');
INSERT INTO `poi` VALUES ('77', '汉长安城未央宫遗址', '未央区', '108.869293', '34.308029', '名胜古迹');
INSERT INTO `poi` VALUES ('78', '养生粥坊', '新城区', '108.971222', '34.274117', '美食养生');
INSERT INTO `poi` VALUES ('79', '养身煨汤', '新城区', '108.970901', '34.271076', '美食养生');
INSERT INTO `poi` VALUES ('81', '五谷养生坊', '长安区', '108.873848', '34.177288', '美食养生');
INSERT INTO `poi` VALUES ('82', '粥八戒养生粥', '未央区', '108.959915', '34.340931', '美食养生');
INSERT INTO `poi` VALUES ('83', '春养生', '碑林区', '108.947708', '34.261818', '美食养生');
INSERT INTO `poi` VALUES ('84', '柳粥记养生粥铺', '未央区', '108.950798', '34.306049', '美食养生');
INSERT INTO `poi` VALUES ('85', '禅茶一味养生茶道坊', '未央区', '108.966049', '34.332333', '美食养生');
INSERT INTO `poi` VALUES ('86', '御品养生苑', '灞桥区', '109.013206', '34.293293', '美食养生');
INSERT INTO `poi` VALUES ('87', '老米家泡馍', '新城区', '108.956696', '34.266445', '美食养生');
INSERT INTO `poi` VALUES ('88', '窄巷子陕菜馆', '雁塔区', '108.976151', '34.205521', '美食养生');
INSERT INTO `poi` VALUES ('89', '头道汤养生馆', '雁塔区', '108.992462', '34.218037', '美食养生');
INSERT INTO `poi` VALUES ('90', '中医养生馆', '未央区', '108.987015', '34.398102', '健康养生');
INSERT INTO `poi` VALUES ('91', '道和汗蒸中医养生', '碑林区', '108.928307', '34.245495', '健康养生');
INSERT INTO `poi` VALUES ('92', '品宜中医养生', '临潼区', '109.379707', '34.622444', '健康养生');
INSERT INTO `poi` VALUES ('93', '生命树中医养生馆', '莲湖区', '108.957550', '34.288994', '健康养生');
INSERT INTO `poi` VALUES ('94', '中医经络养生馆', '灞桥区', '109.066109', '34.293579', '健康养生');
INSERT INTO `poi` VALUES ('95', '权健火疗中医养生馆', '长安区', '108.937500', '34.169048', '健康养生');
INSERT INTO `poi` VALUES ('96', '华润万家(大雁塔店)', '雁塔区', '108.971085', '34.219894', '商场超市');
INSERT INTO `poi` VALUES ('97', '沃尔玛(西安雁塔路店)', '雁塔区', '108.968719', '34.249451', '商场超市');
INSERT INTO `poi` VALUES ('98', '大唐购物中心', '咸阳市', '108.720772', '34.341900', '商城超市');
INSERT INTO `poi` VALUES ('99', '阳阳国际购物广场', '雁塔区', '108.944206', '34.223518', '商城超市');
INSERT INTO `poi` VALUES ('100', '购物广场', '未央区', '108.943764', '34.346268', '商城超市');
INSERT INTO `poi` VALUES ('101', '好又多', '雁塔区', '108.856430', '34.205956', '商城超市');
INSERT INTO `poi` VALUES ('102', '金莎国际购物广场', '雁塔区', '108.953911', '34.232464', '商城超市');
INSERT INTO `poi` VALUES ('103', '民生购物广场', '长安区', '108.925621', '34.205235', '商城超市');
INSERT INTO `poi` VALUES ('104', '陕西师范大学', '长安校区', '108.897713', '34.159031', '校园社区');
INSERT INTO `poi` VALUES ('105', '陕西师范大学', '雁塔区', '108.958923', '34.210979', '校园社区');
INSERT INTO `poi` VALUES ('106', '西安文理学院操场', '雁塔区', '108.913040', '34.222496', '校园社区');
INSERT INTO `poi` VALUES ('107', '西北大学', '碑林区', '108.933655', '34.254326', '校园社区');
INSERT INTO `poi` VALUES ('108', '西安电子科技大学离退休人员活动中心', '雁塔区', '108.924469', '34.235390', '校园社区');
INSERT INTO `poi` VALUES ('109', '西安电子科技大学-老干部活动室', '雁塔区', '108.921623', '34.234959', '校园社区');
INSERT INTO `poi` VALUES ('110', '西安石油大学-社区老人活动室', '雁塔区', '108.937363', '34.220177', '校园社区');
INSERT INTO `poi` VALUES ('111', '西安市长安区韦曲街道广场社区老年互助就餐点', '长安区', '108.929405', '34.170197', '校园社区');
INSERT INTO `poi` VALUES ('112', '咸东社区-老年协会', '新城区', '109.026352', '34.257183', '校园社区');
INSERT INTO `poi` VALUES ('113', '经九社区老年之家', '碑林区', '108.987411', '34.243969', '校园社区');
INSERT INTO `poi` VALUES ('114', '夕阳红老年之家西何社区', '碑林区', '108.931313', '34.244064', '校园社区');
INSERT INTO `poi` VALUES ('115', '天朗社区中老年大学(观园分校)', '莲湖区', '108.909317', '34.272293', '校园社区');
INSERT INTO `poi` VALUES ('116', '陕西老年大学', '碑林区', '108.947998', '34.264923', '校园社区');
INSERT INTO `poi` VALUES ('117', '千户社区老年协会', '雁塔区', '109.011925', '34.240459', '校园社区');
INSERT INTO `poi` VALUES ('118', '曲江社区老年大学', '雁塔区', '108.986946', '34.200382', '校园社区');
INSERT INTO `poi` VALUES ('119', '精密社区老年协会', '莲湖区', '108.885704', '34.279778', '校园社区');
INSERT INTO `poi` VALUES ('120', '八府庄园社区老年协会', '新城区', '108.987297', '34.296524', '校园社区');
INSERT INTO `poi` VALUES ('121', '翁家社区老年活动中心', '未央区', '108.946724', '34.335072', '校园社区');
INSERT INTO `poi` VALUES ('122', '茶道中老年活动中心', '莲湖区', '108.873970', '34.263103', '休闲娱乐');
INSERT INTO `poi` VALUES ('123', '西安市老年书画研究会', '雁塔区', '109.000359', '34.219734', '休闲娱乐');
INSERT INTO `poi` VALUES ('124', '老秦人茶艺剧场', '临潼区', '109.291695', '34.392948', '休闲娱乐');
INSERT INTO `poi` VALUES ('125', '秦韵茶艺', '长安区', '108.869118', '34.166340', '休闲娱乐');
INSERT INTO `poi` VALUES ('126', '雅圣棋牌茶艺', '灞桥区', '109.058487', '34.285892', '休闲娱乐');
INSERT INTO `poi` VALUES ('127', '西安市老年书画研究会', '雁塔', '109.000359', '34.219734', '休闲娱乐');
INSERT INTO `poi` VALUES ('128', '省老年书画学会胡家庙分会', '新城区', '109.005295', '34.284176', '休闲娱乐');
INSERT INTO `poi` VALUES ('129', '西安高新中老年书画艺术交流中心', '雁塔区', '108.910019', '34.226677', '休闲娱乐');
INSERT INTO `poi` VALUES ('130', '秦风韵秦腔茶楼(秦腔青曲社)', '碑林区', '108.964203', '34.249470', '休闲娱乐');
INSERT INTO `poi` VALUES ('131', '秦腔博物馆-北门', '碑林区', '108.986740', '34.248039', '休闲娱乐');
INSERT INTO `poi` VALUES ('132', '雁塔区象棋协会', '雁塔区', '108.921097', '34.203449', '休闲娱乐');
INSERT INTO `poi` VALUES ('133', '未央国际象棋俱乐部', '末央区', '108.940193', '34.355576', '休闲娱乐');
INSERT INTO `poi` VALUES ('134', '曲江书画艺术馆', '雁塔区', '108.971596', '34.211006', '休闲娱乐');
